plan.org
* 文本分类学习 
** 阅读论文《基于Wikipedia语料扩展的短文本数据流分类方法研究》
*** 主要技术学习
**** 短文本分类、数据流分类
**** 聚类
**** 主题模型
**** 特征选择
**** 半监督学习
**** 分类器
***** SVM
***** 随机森林
***** 贝叶斯网络

*** 短文本数据流分类的问题与挑战
      - 文本长度短
      - *特征高维稀疏*
      - 没有足够的语义信息 --> 文本稀疏性问题 
      - 数据产生速度快、数量大，随时间产生潜在的漂移问题
      - 难以使用传统批处理算法快速适应
*** 有监督的短文本分类方法        
**** 基于搜索引擎的短分类方法 
***** 实验步骤
1. 使用 Web 搜索扩充短文本 *ExpaNet*
2. 将短文本和获取的相关文档均用词向量表示
3. 将上述的的词向量丢进 *注意力机制（soft/hard attention）中*, 从而获得检索记忆，用于确定哪些文档是值得研究的
4. 最后借助 *GRU模型* 根据注意力机制整合原始短文本 
5. 可通过多次迭代上述过程，丰富短文本语义信息， *缓解稀疏性问题*
***** 缺点  
1. 影响文本质量
2. 耗时

***** 疑问：实验中是否需要使用Web扩充文本技术

**** 基于主题模型的短文本分类方法
***** Phan等（10）提出的基于隐含主题的框架用于扩展短文本
- 借助 *LDA* 主题模型从外部语料库中挖掘隐含主题
- 构建主题模型推断短文本主题分布
- 选择概率高的主题扩展到短文本中，从而丰富语义信息
***** Bouzaiz  (11)  借助 LDA 模型从单词和文本两个层面扩展短文本
- 减少随机特征的选择
- 利用特征间语义关系构建随机森林
***** Vo和Ock（12）从多种语料库中挖掘隐含主题
- 考虑短文本和其他词的语义关系寻找最适合主题扩展短文本
***** Zhang (13) 提出新的短文本分类框架  
- 该框架中新的词对应的主题会被视作新词整合进短文本
***** Chen (14) 基于LDA和K近邻来提升短文本分类方法
- 发现基于词袋模型的表示方法会导致某些不具备相同术语的短文本很难被正确分类
- 基于LDA和k近邻，如果两个文本某些术语具有相同的几个隐藏主题，则考虑文本之间相似，然后借助 K近邻方法进行分类

 *解决的问题： 借助LDA主题模型扩展短文本，缓解了数据稀疏性问题缺点： LDA本身依赖词袋模型的假设，忽略短文本数据中的语序和短语*

***** Sun(15)主题的N-gram模型（TNG）
步骤：
1. 基于上下文语义发现主题和短语的模型
2. 借助 *TNG* 构建一个 *特征扩展库*  
3. 提出一种短文本的 *主题权值向量* 计算方法 --> 获得短文本 *主题倾向*
4. 根据主题倾向从特征扩展库中选择合适的词和短语扩展短文本
  
**** 基于隐藏规则和统计信息的短文本分类方法
***** Kim（16）提出的基于语义标注的语言独立核方法（LIS）
- *LIS* 在不需要语法标签和词汇数据库，有效的分类短文本数据
***** 
***** Gao（17）引入结构化的稀疏表示
- 提出凸包项点选择方法，减少数据相关性和冗余性，提高分类有效性
***** Zhang (18) 研究基于词汇关联规则的短文本分类方法
1. 首先挖掘训练集中存在的强关联规则
2. 将规则加入短文本特征中提高短文本的特征密度，提高短文本准确性
***** Rao (19) 提出一种主题级最大熵模型（TME）缓解短文本稀疏性
- 用于短文本的 *社交情感分类*
- *TME* 通过挖掘短隐含主题、多重情感标签、众多读者的共同评分生成主题级特征
- 通过将特征映射到概念空间解决 *最大熵原理* 中的过拟合问题

*上述基于隐藏规则和统计信息，虽充分挖掘了短文本数据自身的隐藏规则和统计信息，但短文本本身存在的语义信息不足问题依然没有解决，因此分类效果难以大幅提升*

**** 基于深度学习相关技术的短文本分类方法

*** 有监督的短文本数据流分类方法

***** Bouaziz (25) 提出LGLM模型，通过不断更新分类器提高数据流分类
1. 首先，根据初始训练集训练随机森林分类器
2. 其次，当有数据到来时先利用初始分类器进行分类，同时结合主动学习方法将分错的短文本加入训练集
3. 通过计算先前数据集和当前数据集信息增益的差值决定时候更新分类模型

***** Ren(26)提出分层多标签短文本数据流分类 
1. 首先，基于实体链接和查询语句的排序方法扩展短文本
2. 然后，通过将主题分成动态全局主题和局部主题构建动态概率主题分布
3. 最后，使用基于块的结构优化策略分类短文本
***** Li(27)提出一种增量式的集成模型适应短文本数据流
1. 首先，使用公开语义网络Probase用于扩展特征空间
   - 引入更多的基于短文本隐藏术语的语义上下文信息弥补数据的稀疏性
   - 同时减少噪音影响
   - 消除所有术语的歧义
2. 基于概念簇的主题漂移检测算法用于追踪数据流中的主题漂移
3. 构建增量式的集成模型预测短文本数据流


*** OnlineBTM (Online Biterm topic model)  在线主题模型
**** BTM 模型 （适用于短文本的主题模型）



*** 基于主题的概念漂移检测算法



