plan.html
<!DOCTYPE html>
<html lang="cn">
<head>
<!-- 2019-12-12 Thu 14:56 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>&lrm;</title>
<meta name="generator" content="Org mode">
<meta name="author" content="allen">
<link rel="stylesheet" href="https://cs6.swfu.edu.cn/org.css" type="text/css">
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2a071f1">1. 文本分类学习</a>
<ul>
<li><a href="#org1acc11b">1.1. 阅读论文《基于Wikipedia语料扩展的短文本数据流分类方法研究》</a>
<ul>
<li><a href="#orgd328d16">1.1.1. 主要技术学习</a></li>
<li><a href="#org0de2641">1.1.2. 短文本数据流分类的问题与挑战</a></li>
<li><a href="#orgbdf9b07">1.1.3. 有监督的短文本分类方法</a></li>
<li><a href="#org6d20fd2">1.1.4. 有监督的短文本数据流分类方法</a></li>
<li><a href="#org9e72c1c">1.1.5. OnlineBTM (Online Biterm topic model)  在线主题模型</a></li>
<li><a href="#org301b11a">1.1.6. 基于主题的概念漂移检测算法</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org2a071f1" class="outline-2">
<h2 id="org2a071f1"><span class="section-number-2">1</span> 文本分类学习</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org1acc11b" class="outline-3">
<h3 id="org1acc11b"><span class="section-number-3">1.1</span> 阅读论文《基于Wikipedia语料扩展的短文本数据流分类方法研究》</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orgd328d16" class="outline-4">
<h4 id="orgd328d16"><span class="section-number-4">1.1.1</span> 主要技术学习</h4>
<div class="outline-text-4" id="text-1-1-1">
</div>
<ol class="org-ol">
<li><a id="org1470524"></a>短文本分类、数据流分类<br></li>
<li><a id="org056f41a"></a>聚类<br></li>
<li><a id="orgf906254"></a>主题模型<br></li>
<li><a id="orga1d1c33"></a>特征选择<br></li>
<li><a id="orgc53db3c"></a>半监督学习<br></li>
<li><a id="org84277b0"></a>分类器<br>
<ol class="org-ol">
<li><a id="org36d3e4d"></a>SVM<br></li>
<li><a id="org55c3cac"></a>随机森林<br></li>
<li><a id="org27d12f0"></a>贝叶斯网络<br></li>
</ol>
</li>
</ol>
</div>

<div id="outline-container-org0de2641" class="outline-4">
<h4 id="org0de2641"><span class="section-number-4">1.1.2</span> 短文本数据流分类的问题与挑战</h4>
<div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li>文本长度短</li>
<li><b>特征高维稀疏</b></li>
<li>没有足够的语义信息 &#x2013;&gt; 文本稀疏性问题</li>
<li>数据产生速度快、数量大，随时间产生潜在的漂移问题</li>
<li>难以使用传统批处理算法快速适应</li>
</ul>
</div>
</div>
<div id="outline-container-orgbdf9b07" class="outline-4">
<h4 id="orgbdf9b07"><span class="section-number-4">1.1.3</span> 有监督的短文本分类方法</h4>
<div class="outline-text-4" id="text-1-1-3">
</div>
<ol class="org-ol">
<li><a id="org71007e3"></a>基于搜索引擎的短分类方法<br>
<ol class="org-ol">
<li><a id="org89b8245"></a>实验步骤<br>
<div class="outline-text-6" id="text-1-1-3-1-1">
<ol class="org-ol">
<li>使用 Web 搜索扩充短文本 <b>ExpaNet</b></li>
<li>将短文本和获取的相关文档均用词向量表示</li>
<li>将上述的的词向量丢进 <b>注意力机制（soft/hard attention）中</b>, 从而获得检索记忆，用于确定哪些文档是值得研究的</li>
<li>最后借助 <b>GRU模型</b> 根据注意力机制整合原始短文本</li>
<li>可通过多次迭代上述过程，丰富短文本语义信息， <b>缓解稀疏性问题</b></li>
</ol>
</div>
</li>
<li><a id="org9741095"></a>缺点<br>
<div class="outline-text-6" id="text-1-1-3-1-2">
<ol class="org-ol">
<li>影响文本质量</li>
<li>耗时</li>
</ol>
</div>
</li>

<li><a id="org5911fb7"></a>疑问：实验中是否需要使用Web扩充文本技术<br></li>
</ol>
</li>

<li><a id="orgacf3a5a"></a>基于主题模型的短文本分类方法<br>
<ol class="org-ol">
<li><a id="org5fdae45"></a>Phan等（10）提出的基于隐含主题的框架用于扩展短文本<br>
<div class="outline-text-6" id="text-1-1-3-2-1">
<ul class="org-ul">
<li>借助 <b>LDA</b> 主题模型从外部语料库中挖掘隐含主题</li>
<li>构建主题模型推断短文本主题分布</li>
<li>选择概率高的主题扩展到短文本中，从而丰富语义信息</li>
</ul>
</div>
</li>
<li><a id="org38338c6"></a>Bouzaiz  (11)  借助 LDA 模型从单词和文本两个层面扩展短文本<br>
<div class="outline-text-6" id="text-1-1-3-2-2">
<ul class="org-ul">
<li>减少随机特征的选择</li>
<li>利用特征间语义关系构建随机森林</li>
</ul>
</div>
</li>
<li><a id="org6989e77"></a>Vo和Ock（12）从多种语料库中挖掘隐含主题<br>
<div class="outline-text-6" id="text-1-1-3-2-3">
<ul class="org-ul">
<li>考虑短文本和其他词的语义关系寻找最适合主题扩展短文本</li>
</ul>
</div>
</li>
<li><a id="org7e789ab"></a>Zhang (13) 提出新的短文本分类框架<br>
<div class="outline-text-6" id="text-1-1-3-2-4">
<ul class="org-ul">
<li>该框架中新的词对应的主题会被视作新词整合进短文本</li>
</ul>
</div>
</li>
<li><a id="org05e2908"></a>Chen (14) 基于LDA和K近邻来提升短文本分类方法<br>
<div class="outline-text-6" id="text-1-1-3-2-5">
<ul class="org-ul">
<li>发现基于词袋模型的表示方法会导致某些不具备相同术语的短文本很难被正确分类</li>
<li><p>
基于LDA和k近邻，如果两个文本某些术语具有相同的几个隐藏主题，则考虑文本之间相似，然后借助 K近邻方法进行分类
</p>

<p>
<b>解决的问题： 借助LDA主题模型扩展短文本，缓解了数据稀疏性问题缺点： LDA本身依赖词袋模型的假设，忽略短文本数据中的语序和短语</b>
</p></li>
</ul>
</div>
</li>

<li><a id="org3125dd6"></a>Sun(15)主题的N-gram模型（TNG）<br>
<div class="outline-text-6" id="text-1-1-3-2-6">
<p>
步骤：
</p>
<ol class="org-ol">
<li>基于上下文语义发现主题和短语的模型</li>
<li>借助 <b>TNG</b> 构建一个 <b>特征扩展库</b></li>
<li>提出一种短文本的 <b>主题权值向量</b> 计算方法 &#x2013;&gt; 获得短文本 <b>主题倾向</b></li>
<li>根据主题倾向从特征扩展库中选择合适的词和短语扩展短文本</li>
</ol>
</div>
</li>
</ol>
</li>

<li><a id="org89dd563"></a>基于隐藏规则和统计信息的短文本分类方法<br>
<ol class="org-ol">
<li><a id="org8346dc8"></a>Kim（16）提出的基于语义标注的语言独立核方法（LIS）<br>
<div class="outline-text-6" id="text-1-1-3-3-1">
<ul class="org-ul">
<li><b>LIS</b> 在不需要语法标签和词汇数据库，有效的分类短文本数据</li>
</ul>
</div>
</li>
<li><a id="org0002fd7"></a><br></li>
<li><a id="org10d6f91"></a>Gao（17）引入结构化的稀疏表示<br>
<div class="outline-text-6" id="text-1-1-3-3-3">
<ul class="org-ul">
<li>提出凸包项点选择方法，减少数据相关性和冗余性，提高分类有效性</li>
</ul>
</div>
</li>
<li><a id="org9278b15"></a>Zhang (18) 研究基于词汇关联规则的短文本分类方法<br>
<div class="outline-text-6" id="text-1-1-3-3-4">
<ol class="org-ol">
<li>首先挖掘训练集中存在的强关联规则</li>
<li>将规则加入短文本特征中提高短文本的特征密度，提高短文本准确性</li>
</ol>
</div>
</li>
<li><a id="org293c904"></a>Rao (19) 提出一种主题级最大熵模型（TME）缓解短文本稀疏性<br>
<div class="outline-text-6" id="text-1-1-3-3-5">
<ul class="org-ul">
<li>用于短文本的 <b>社交情感分类</b></li>
<li><b>TME</b> 通过挖掘短隐含主题、多重情感标签、众多读者的共同评分生成主题级特征</li>
<li>通过将特征映射到概念空间解决 <b>最大熵原理</b> 中的过拟合问题</li>
</ul>

<p>
<b>上述基于隐藏规则和统计信息，虽充分挖掘了短文本数据自身的隐藏规则和统计信息，但短文本本身存在的语义信息不足问题依然没有解决，因此分类效果难以大幅提升</b>
</p>
</div>
</li>
</ol>
</li>

<li><a id="orgb92ffe4"></a>基于深度学习相关技术的短文本分类方法<br></li>
</ol>
</div>

<div id="outline-container-org6d20fd2" class="outline-4">
<h4 id="org6d20fd2"><span class="section-number-4">1.1.4</span> 有监督的短文本数据流分类方法</h4>
<div class="outline-text-4" id="text-1-1-4">
</div>
<ol class="org-ol">
<li><a id="org0c44fbe"></a>Bouaziz (25) 提出LGLM模型，通过不断更新分类器提高数据流分类<br>
<div class="outline-text-6" id="text-1-1-4-0-1">
<ol class="org-ol">
<li>首先，根据初始训练集训练随机森林分类器</li>
<li>其次，当有数据到来时先利用初始分类器进行分类，同时结合主动学习方法将分错的短文本加入训练集</li>
<li>通过计算先前数据集和当前数据集信息增益的差值决定时候更新分类模型</li>
</ol>
</div>
</li>

<li><a id="org36f5587"></a>Ren(26)提出分层多标签短文本数据流分类<br>
<div class="outline-text-6" id="text-1-1-4-0-2">
<ol class="org-ol">
<li>首先，基于实体链接和查询语句的排序方法扩展短文本</li>
<li>然后，通过将主题分成动态全局主题和局部主题构建动态概率主题分布</li>
<li>最后，使用基于块的结构优化策略分类短文本</li>
</ol>
</div>
</li>
<li><a id="org1ba8bf6"></a>Li(27)提出一种增量式的集成模型适应短文本数据流<br>
<div class="outline-text-6" id="text-1-1-4-0-3">
<ol class="org-ol">
<li>首先，使用公开语义网络Probase用于扩展特征空间
<ul class="org-ul">
<li>引入更多的基于短文本隐藏术语的语义上下文信息弥补数据的稀疏性</li>
<li>同时减少噪音影响</li>
<li>消除所有术语的歧义</li>
</ul></li>
<li>基于概念簇的主题漂移检测算法用于追踪数据流中的主题漂移</li>
<li>构建增量式的集成模型预测短文本数据流</li>
</ol>
</div>
</li>
</ol>
</div>


<div id="outline-container-org9e72c1c" class="outline-4">
<h4 id="org9e72c1c"><span class="section-number-4">1.1.5</span> OnlineBTM (Online Biterm topic model)  在线主题模型</h4>
<div class="outline-text-4" id="text-1-1-5">
</div>
<ol class="org-ol">
<li><a id="org7eb25f1"></a>BTM 模型 （适用于短文本的主题模型）<br></li>
</ol>
</div>



<div id="outline-container-org301b11a" class="outline-4">
<h4 id="org301b11a"><span class="section-number-4">1.1.6</span> 基于主题的概念漂移检测算法</h4>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: allen</p>
<p class="date">Created: 2019-12-12 Thu 14:56</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
